#!/usr/bin/env ruby
# encoding: utf-8
require 'nokogiri'
require 'open-uri'
require 'watir-webdriver'
require 'json'

ibikeLocation = {
	"北區行政大樓" => {"lat" => "24.165899", "lng" => "120.682366"},
	"博館育德路口" => {"lat" => "24.1574614", "lng" => "120.6691935"},
	"國立自然科學博物館" => {"lat" => "24.156250", "lng" => "120.665875"},
	"太原北中清路口" => {"lat" => "24.165132", "lng" => "120.673279"},
	"學士育德路口" => {"lat" => "24.157811", "lng" => "120.681172"},
	"臺中公園" => {"lat" => "24.142539", "lng" => "120.684291"},
	"臺中孔廟" => {"lat" => "24.153300", "lng" => "120.689310"},
	"英士公園" => {"lat" => "24.151175", "lng" => "120.675549"},
	"五權西文心路口" => {"lat" => "24.139906", "lng" => "120.646912"},
	"公益大英街口" => {"lat" => "24.150745", "lng" => "120.648530"},
	"文心森林公園" => {"lat" => "24.146776", "lng" => "120.646350"},
	"BRT中正國小" => {"lat" => "24.152514", "lng" => "120.666314"},
	"BRT科博館/金典酒店" => {"lat" => "24.155495", "lng" => "120.663068"},
	"BRT茄苳腳" => {"lat" => "24.150021", "lng" => "120.671245"},
	"中山地政事務所" => {"lat" => "24.136550", "lng" => "120.673675"},
	"公益公園" => {"lat" => "24.151321", "lng" => "120.657661"},
	"國立臺灣美術館" => {"lat" => "24.141031", "lng" => "120.661843"},
	"大墩文化中心" => {"lat" => "24.141207", "lng" => "120.666615"},
	"市民廣場" => {"lat" => "24.150774", "lng" => "120.663024"},
	"臺中州廳" => {"lat" => "24.138219", "lng" => "120.678683"},
	"臺中教育大學" => {"lat" => "24.145197", "lng" => "120.671138"},
	"萬壽棒球場" => {"lat" => "24.146560", "lng" => "120.650585"},
	"BRT新光/遠百" => {"lat" => "24.165977", "lng" => "120.643178"},
	"BRT頂何厝" => {"lat" => "24.159105", "lng" => "120.655826"},
	"大隆東興路口" => {"lat" => "24.155732", "lng" => "120.654054"},
	"市政府(文心樓)" => {"lat" => "24.161428", "lng" => "120.648693"},
	"漢翔福星北路口" => {"lat" => "24.185216", "lng" => "120.644315"},
	"福星公園" => {"lat" => "24.172492", "lng" => "120.648127"},
	"秋紅谷" => {"lat" => "24.168062", "lng" => "120.638990"},
	"逢甲大學" => {"lat" => "24.178721", "lng" => "120.645043"},
	"櫻花棒球場" => {"lat" => "24.168701", "lng" => "120.653070"},
	"大墩七街河南路口" => {"lat" => "24.144299", "lng" => "120.639467"},
	"力行國小" => {"lat" => "24.151562", "lng" => "120.693953"},
	"國立臺中文華高中" => {"lat" => "24.171246", "lng" => "120.660591"},
	"北屯兒童公園" => {"lat" => "24.170184", "lng" => "120.694248"},
	"賴明公園" => {"lat" => "24.167134", "lng" => "120.678397"},
	"臺中一中" => {"lat" => "24.149191", "lng" => "120.686449"},
	"臺中火車站" => {"lat" => "24.136743", "lng" => "120.683804"},
	"重慶公園" => {"lat" => "24.165904", "lng" => "120.655539"},
	"忠誠公園" => {"lat" => "24.161100", "lng" => "120.662740"},
	########彰化員林
	"三多公園" => {"lat" => "23.969971", "lng" => "120.571364"},
	"三樺公園" => {"lat" => "23.968025", "lng" => "120.576793"},
	"三角公園" => {"lat" => "23.962391", "lng" => "120.570944"},
	"員林分局" => {"lat" => "23.962978", "lng" => "120.579697"},
	"員林國小" => {"lat" => "23.960241", "lng" => "120.580071"},
	"員林演藝廳" => {"lat" => "23.949158", "lng" => "120.578820"},
	"員林火車站前廣場" => {"lat" => "23.959345", "lng" => "120.570463"},
	"員林轉運站" => {"lat" => "23.962393", "lng" => "120.568897"},
	"員林農工" => {"lat" => "23.955406", "lng" => "120.581333"},
	"員林郵局" => {"lat" => "23.957809", "lng" => "120.577638"},
	"員林鎮公所" => {"lat" => "23.958936", "lng" => "120.574704"},
	"員林高中" => {"lat" => "23.962390", "lng" => "120.563441"},
	"崇實高工" => {"lat" => "23.962035", "lng" => "120.574807"},
	"彰化地方法院" => {"lat" => "23.965906", "lng" => "120.571699"},
	"泰山停車場" => {"lat" => "23.965112", "lng" => "120.575778"},
	"第一市場" => {"lat" => "23.956455", "lng" => "120.573023"},
	"老人文康活動中心" => {"lat" => "23.952786", "lng" => "120.571780"},
	"育英國小" => {"lat" => "23.952879", "lng" => "120.574355"},
	"至善公園" => {"lat" => "23.959661", "lng" => "120.564833"},
	####彰化彰化市
	"中山國小" => {"lat" => "24.082026", "lng" => "120.546253"},
	"中正公園" => {"lat" => "24.068077", "lng" => "120.531082"},
	"信義國中(小)" => {"lat" => "24.063276", "lng" => "120.527606"},
	"原住民生活館" => {"lat" => "24.086449", "lng" => "120.559967"},
	"大成國小" => {"lat" => "24.091262", "lng" => "120.546390"},
	"平和國小" => {"lat" => "24.071111", "lng" => "120.535803"},
	"延平公園" => {"lat" => "24.066211", "lng" => "120.540597"},
	"建國科技大學" => {"lat" => "24.067838", "lng" => "120.548375"},
	"彰化基督教醫院" => {"lat" => "24.071242", "lng" => "120.545406"},
	"彰化師範大學" => {"lat" => "24.082834", "lng" => "120.558695"},
	"彰化火車站前站" => {"lat" => "24.081167", "lng" => "120.539070"},
	"彰化火車站後站" => {"lat" => "24.082406", "lng" => "120.536975"},
	"彰化秀傳醫院" => {"lat" => "24.065211", "lng" => "120.537479"},
	"彰化縣政府" => {"lat" => "24.074990", "lng" => "120.545088"},
	"彰化縣立圖書館" => {"lat" => "24.078412", "lng" => "120.545066"},
	"彰化縣衛生局" => {"lat" => "24.068968", "lng" => "120.541182"},
	"彰化縣警察局" => {"lat" => "24.065250", "lng" => "120.534579"},
	"彰化藝術高中" => {"lat" => "24.075635", "lng" => "120.554249"},
	"彰化高中" => {"lat" => "24.073762", "lng" => "120.548602"},
	"彰師附工" => {"lat" => "24.084205", "lng" => "120.556272"},
	"彰興國中" => {"lat" => "24.059207", "lng" => "120.538358"},
	"忠孝國小" => {"lat" => "24.084517", "lng" => "120.531835"},
	"成功社區活動中心" => {"lat" => "24.071206", "lng" => "120.541700"},
	"民族路219巷路口" => {"lat" => "24.070974", "lng" => "120.539078"},
	"泰和國小" => {"lat" => "24.093677", "lng" => "120.552427"},
	"漢銘醫院" => {"lat" => "24.061103", "lng" => "120.535732"},
	"精誠中學" => {"lat" => "24.073396", "lng" => "120.527426"},
	"縣府第二辦公大樓" => {"lat" => "24.069644", "lng" => "120.545830"},
	"華興公園" => {"lat" => "24.091256", "lng" => "120.538042"},
	"長安中華路口(彰基中華分院)" => {"lat" => "24.078510", "lng" => "120.539320"},
	"陽明國中" => {"lat" => "24.086843", "lng" => "120.549461"},
	######彰化鹿港
	"彰化縣旅遊服務中心" => {"lat" => "24.058933", "lng" => "120.434454"},
	"復興南三民路口(摸乳巷)" => {"lat" => "24.050980", "lng" => "120.431726"},
	"文開國小(天后宮停車場)" => {"lat" => "24.056425", "lng" => "120.428766"},
	"桂花巷藝術村" => {"lat" => "24.056384", "lng" => "120.430651"},
	"洛津國小" => {"lat" => "24.055570", "lng" => "120.429225"},
	"福興第一停車場" => {"lat" => "24.052606", "lng" => "120.438883"},
	"第一立體停車場" => {"lat" => "24.053666", "lng" => "120.432805"},
	"鹿東國小" => {"lat" => "24.058626", "lng" => "120.441898"},
	"鹿港分局" => {"lat" => "24.059023", "lng" => "120.438166"},
	"鹿港圖書藝文中心" => {"lat" => "24.046601", "lng" => "120.438369"},
	"鹿港基督教醫院" => {"lat" => "24.060973", "lng" => "120.437754"},
	"鹿港文武廟" => {"lat" => "24.049327", "lng" => "120.438899"},
	"鹿港民俗文物館" => {"lat" => "24.054173", "lng" => "120.436709"},
	"鹿港運動場(勞工教育學苑)" => {"lat" => "24.062773", "lng" => "120.435285"},
	"鹿港鎮公所" => {"lat" => "24.057126", "lng" => "120.434880"},
	"鹿港鎮立圖書館" => {"lat" => "24.055126", "lng" => "120.431354"},
	"鹿港頂厝公園" => {"lat" => "24.055011", "lng" => "120.444372"},
	"鹿港高中" => {"lat" => "24.060366", "lng" => "120.427076"}
}

#指定工作目錄
dir_path = "."
puts "chdir #{dir_path}"
Dir.chdir(dir_path)

ibike_url = "http://i.youbike.com.tw/cht/f12.php"
cbike_url = "http://chcg.youbike.com.tw/cht/f12.php"
browser = Watir::Browser.new
browser.goto ibike_url
i_html = browser.html
browser.goto cbike_url
c_html = browser.html
browser.close
i_doc = Nokogiri::HTML("#{i_html}", nil, 'UTF-8')
c_doc = Nokogiri::HTML("#{c_html}", nil, 'UTF-8')

contents = i_doc.xpath("//div[@id='content_page']//div[@id='stationList']//table//tbody//tr")
contents += c_doc.xpath("//div[@id='content_page']//div[@id='stationList']//table//tbody//tr")
bikeArray = Array.new
contents.each do |content|
	#system("wget -P #{name} #{img}")
	xml_doc = Nokogiri.XML("#{content}", nil, 'UTF-8')
	
	sarea = "#{xml_doc.xpath("//td[1]")[0].text}"
	sna = "#{xml_doc.xpath("//td[2]")[0].text}"
	sbi = "#{xml_doc.xpath("//td[3]//p")[0].text}"
	bemp = "#{xml_doc.xpath("//td[3]//p")[1].text}"

	if ibikeLocation["#{sna}"] != nil 
		posStation = ibikeLocation["#{sna}"]	
	else 
		posStation = {"lat" => "24.154802", "lng" => "120.663410"}
	end

	puts "區域:#{sarea} \n"
	puts "站名:#{sna} \n"
	puts "可借車輛:#{sbi} \n"
	puts "可停車輛:#{bemp} \n"
	puts "北緯:#{posStation["lat"]} \n"
	puts "東經:#{posStation["lng"]} \n"
	puts "------------------#{DateTime.now.strftime('%Y/%m/%d %I:%M%p')}------------------------- \n"
	
	tempHash = {
		"sarea" => "#{sarea}",
		"sna" => "#{sna}",
		"sbi" => "#{sbi}",
		"bemp" => "#{bemp}",
		"lat" => "#{posStation["lat"]}",
		"lng" => "#{posStation["lng"]}",
		"update" => "#{DateTime.now.strftime('%Y/%m/%d %I:%M%p')}"
	}

	bikeArray.push(tempHash)

end

filePath = '/home/beemolin/backup/ibike/ibike.json'

File.open("#{filePath}","w") do |f|
		f.write("#{bikeArray.to_json}")
		sleep 0.1
end

# BM-2cX7NMFyEtwZZcXybLBRpwK4woUwta6fqs@bitmessage.ch
# godjjinin
